In [1]:
import pandas as pd

df = pd.read_csv("datasets/Titanic-Dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
#Check original Fare values (before update)
df.loc[df["Survived"] == 1, ["Survived", "Fare"]].head()

In [ ]:
# Increase Fare by 10 for survivors
df.loc[df["Survived"] == 1, "Fare"] += 10

In [ ]:
# Verify update
df.loc[df["Survived"] == 1, ["Survived", "Fare"]].head()

In [2]:
# Fill missing Age with 30
df.loc[df["Age"].isna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [ ]:
df.loc[df["Age"].isna(), "Age"] = 30

In [ ]:
# your task :Replace Embarked 'S' with 'Southampton'

In [ ]:
# Increase Age by 1 for male survivors
df.loc[(df["Sex"] == "male") & (df["Survived"] == 1), "Age"] += 1

In [ ]:
## your taskSet Fare = 0 for non-survivors in 3rd class

In [3]:
# Update Age and Fare for 1st class passengers
df.loc[df["Pclass"] == 1, ["Age", "Fare"]] = [40, 100]

In [4]:
# Verify multiple column update
df.loc[df["Pclass"] == 1, ["Age", "Fare"]].head()

     Age   Fare
1   40.0  100.0
3   40.0  100.0
6   40.0  100.0
11  40.0  100.0
23  40.0  100.0

In [ ]:
# Add 20 Fare to Class 1 and 2 passengers
df.loc[df["Pclass"].isin([1, 2]), "Fare"] += 20

In [ ]:
# Verify update
df.loc[df["Pclass"].isin([1, 2]), ["Pclass", "Fare"]].head()

In [5]:
# Fill missing Cabin with "Unknown"